# Practical exam 2

Name: Ricardo Villarreal Baz√°n 

Student ID: A01666859

You are given this semester's data about students grades in a small campus of a university. The data is given to you as a .sql file for a sqlite3 database. 

- Each course is taught by a single professor each semester.
- Each semester a single group is open for a course, so we don't model groups in the database.

Your task is to recreate the database and answer answer some questions about the data. You must provide the necessary code to output the answers and add any conclusions if required. Each question must be answered in its own section.

You must open a single database connection in this notebook and properly close it.

## 1. Provide a table with ONLY the student_id and the full name of all students.

In [1]:
import sqlite3
import pandas as pd

bob = sqlite3.connect('university.db')

pd.read_sql("SELECT student_id, first_name || ' ' || last_name AS full_name FROM students;",bob)

   student_id         full_name
0           1       Emily Brown
1           2        Jane Smith
2           3      Mark Johnson
3           4          John Doe
4           5  Michael Williams
5           6       Sarah Davis
6           7      David Miller
7           8     Sophia Garcia
8           9   Daniel Martinez
9          10  Olivia Rodriguez

## 2. What was the score average over all courses? 
We don't want a weighted average by course, each evaluation of a student in a course must have the same weight.

In [31]:
query = """
SELECT AVG(grade) AS average_score
FROM student_courses;
"""

cursor = bob.cursor()
cursor.execute(query)
average_score = cursor.fetchone()[0]


print("Average score across all student-course evaluations:") 
average_score

Average score across all student-course evaluations:

77.35

# 3. Provide a list of the students that have failed at least one course.

Provide only their full names. Each student must appear once in this list, even if they failed multiple courses.

In [59]:
print("Students who've failed one couse:")
pd.read_sql("SELECT DISTINCT s.first_name || ' ' || s.last_name AS full_name FROM students s JOIN student_courses sc ON s.student_id = sc.student_id WHERE sc.grade < 70;",bob)

Students who've failed one couse:

          full_name
0        Jane Smith
1          John Doe
2  Michael Williams
3      David Miller
4  Olivia Rodriguez

# 4. Provide a table with the average grade by course for this semester.

- We want to see only the course name, and the average grade of students enrolled in the course.
- The average grade column must be called **average_grade**.

In [33]:
pd.read_sql("SELECT c.course_name, AVG(sc.grade) AS average_grade FROM courses c JOIN student_courses sc ON c.course_id = sc.course_id GROUP BY c.course_name;",bob)

               course_name  average_grade
0               Algorithms      78.666667
1  Artificial Intelligence      85.500000
2        Computer Networks      90.500000
3             Data Science      82.000000
4         Database Systems      71.500000
5     Discrete Mathematics      73.000000
6        Operating Systems      74.000000
7    Programming Languages      71.666667
8     Software Engineering      72.500000
9          Web Development      80.000000

# 5. Are there any departments listed in the database that didn't offer courses this semester? Provide a list if there are any.

In [60]:
print("Departments that didn`t offer classes: ")
pd.read_sql("SELECT d.department_name FROM departments d LEFT JOIN faculty f ON d.department_id = f.department_id LEFT JOIN courses c ON f.faculty_id = c.professor_id WHERE c.course_id IS NULL;",bob)

Departments that didn`t offer classes:

          department_name
0        Computer Science
1  Mechanical Engineering
2       Civil Engineering
3    Chemical Engineering
4               Chemistry
5               Economics

# 6. Which professor has the most failed students this semester (below 70), and how many students failed with this professor?

In [42]:
pd.read_sql("SELECT f.faculty_name, COUNT(*) AS failed_students FROM student_courses sc JOIN courses c ON sc.course_id = c.course_id JOIN faculty f ON c.professor_id = f.faculty_id WHERE sc.grade < 70 GROUP BY f.faculty_name ORDER BY failed_students DESC LIMIT 1;",bob)

      faculty_name  failed_students
0  Dr. Alan Turing                2

# 7. Extra. What improvements would you suggest to the database?

You can think about:

- Complex queries that you made that could be easier with a better design.
- Improvements needed if the university were to grow.

## 1. Adding a semester table to keep records on the courses 
## 2. Making an hour table to see how many hours does a course give